---
kind: method
id: M:Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.IsAdaptiveFamilySymbol(Autodesk.Revit.DB.FamilySymbol)
source: html/98893a0e-0648-53c4-af07-ae3cb90de489.htm
---
# Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.IsAdaptiveFamilySymbol Method

Verifies if a FamilySymbol is a valid Adaptive Family Symbol.

## Syntax (C#)
```csharp
public static bool IsAdaptiveFamilySymbol(
	FamilySymbol famSymb
)
```

## Parameters
- **famSymb** (`Autodesk.Revit.DB.FamilySymbol`) - The FamilySymbol

## Returns
True if the FamilySymbol is a valid Adaptive Family Symbol.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null